# Day 22/60 of Machine Learning From Basics 
# Data Analysis: Panda series part 5

<h3>Concatination of DataFrames ans operations on it.</h3>

In [23]:
import pandas as pd

np_weather= pd.DataFrame({
    "city": ["kathmandu","makwanpur","bhaktapur"],
    "temperature": [28,31,32],
    "humidity":[60,80,77]
})
np_weather

        city  temperature  humidity
0  kathmandu           28        60
1  makwanpur           31        80
2  bhaktapur           32        77

In [24]:
in_weather = pd.DataFrame({
    "city": ["mumbai","bangalore","delhi"],
    "temperature": [24,23,35],
    "humidity":[61,70,77]
})
in_weather

        city  temperature  humidity
0     mumbai           24        61
1  bangalore           23        70
2      delhi           35        77

In [25]:
# concating DataFrames

weather = pd.concat([np_weather,in_weather])
weather

        city  temperature  humidity
0  kathmandu           28        60
1  makwanpur           31        80
2  bhaktapur           32        77
0     mumbai           24        61
1  bangalore           23        70
2      delhi           35        77

In [26]:
# index is wrong after concating the DataFrames
# for that we need to use ignore_index = True in concat() method in pandas
weather = pd.concat([np_weather,in_weather],ignore_index = True)
weather

        city  temperature  humidity
0  kathmandu           28        60
1  makwanpur           31        80
2  bhaktapur           32        77
3     mumbai           24        61
4  bangalore           23        70
5      delhi           35        77

In [27]:
weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   city         6 non-null      object
 1   temperature  6 non-null      int64
 2   humidity     6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes

In [28]:
weather.describe()

       temperature   humidity
count     6.000000   6.000000
mean     28.833333  70.833333
std       4.708149   8.658329
min      23.000000  60.000000
25%      25.000000  63.250000
50%      29.500000  73.500000
75%      31.750000  77.000000
max      35.000000  80.000000

<h3>Let's index the country name:</h3>

In [29]:
weather = pd.concat([np_weather,in_weather],keys = ["Nepal","India"])
weather

              city  temperature  humidity
Nepal 0  kathmandu           28        60
      1  makwanpur           31        80
      2  bhaktapur           32        77
India 0     mumbai           24        61
      1  bangalore           23        70
      2      delhi           35        77

In [30]:
# this helps in retrieving the data more easily
weather.loc["Nepal"]

        city  temperature  humidity
0  kathmandu           28        60
1  makwanpur           31        80
2  bhaktapur           32        77

In [31]:
weather.loc["India"]

        city  temperature  humidity
0     mumbai           24        61
1  bangalore           23        70
2      delhi           35        77

<h2>Now you want to concatinate in Column</h2>

In [32]:
np_weather= pd.DataFrame({
    "city": ["kathmandu","makwanpur","bhaktapur"],
    "temperature": [28,31,32],
    "humidity":[60,80,77]
})
np_weather

        city  temperature  humidity
0  kathmandu           28        60
1  makwanpur           31        80
2  bhaktapur           32        77

In [33]:
# lets add windspeed
ws = pd.DataFrame({
    "city": ["kathmandu","makwanpur","bhaktapur"],
    "windspeed": [6,12,14]
})
ws

        city  windspeed
0  kathmandu          6
1  makwanpur         12
2  bhaktapur         14

<h3>lets add windspeed DataFrame in column</h3>

In [34]:
a = pd.concat([np_weather,ws],axis = 1)
a

        city  temperature  humidity       city  windspeed
0  kathmandu           28        60  kathmandu          6
1  makwanpur           31        80  makwanpur         12
2  bhaktapur           32        77  bhaktapur         14

<h3>Let's concatinate series to DataFrame</h3>

In [35]:
ws = pd.DataFrame({
    "city": ["kathmandu","makwanpur","bhaktapur"],
    "windspeed": [6,12,14]
})
event = pd.Series(["humid","Rain","Snow"],name ="event")
event

0    humid
1     Rain
2     Snow
Name: event, dtype: object

In [36]:
c = pd.concat([ws,event],axis = 1)
c

        city  windspeed  event
0  kathmandu          6  humid
1  makwanpur         12   Rain
2  bhaktapur         14   Snow